Config/Catalogs/РазделыМакетовОтображения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыМакетовОтображения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.МакетыОтображенияОтчетов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтрокиРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтрокаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КолонкиРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КолонкаОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШапкаРаздела</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементОтчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтрокиОтчетов</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АналитикаОтчетов</v8:Type>
								<v8:Type>cfg:CatalogRef.КолонкиОтчетов</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зафиксирована</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаголовокЭлемента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаЭлемента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БезЗаголовка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПустого</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НуженОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/РазделыМакетовОтображения/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Не ЭтоКопирование() и Не СтрокиИГрафыПринадлежатВладельцу() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ОбнаруженыДублиВТабличныхЧастях() Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования.Ссылка);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКопирование() Тогда
		
		СкопироватьПодчиненныеДанные();
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция СоздатьВременнуюТаблицуКомпонентовОтчета()

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаСтрокиОтчета" , СтрокиРаздела.Выгрузить());
	Запрос.УстановитьПараметр("ТаблицаКолонкиОтчета", КолонкиРаздела.Выгрузить());
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Таб.НомерСтроки КАК НомерСтроки,
	|	Таб.СтрокаОтчета КАК Ссылка,
	|	Таб.Заголовок
	|ПОМЕСТИТЬ Строки
	|ИЗ
	|	&ТаблицаСтрокиОтчета КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таб.НомерСтроки,
	|	Таб.КолонкаОтчета КАК Ссылка,
	|	Таб.Заголовок
	|ПОМЕСТИТЬ Колонки
	|ИЗ
	|	&ТаблицаКолонкиОтчета КАК Таб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	""СтрокиРаздела"" КАК ИмяТаблицы,
	|	Строки.НомерСтроки,
	|	Строки.Ссылка,
	|	Строки.Заголовок,
	|	Строки.Ссылка.Код КАК Код
	|ПОМЕСТИТЬ КомпонентыОтчета
	|ИЗ
	|	Строки КАК Строки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""КолонкиРаздела"",
	|	Колонки.НомерСтроки,
	|	Колонки.Ссылка,
	|	Колонки.Заголовок,
	|	Колонки.Ссылка.Код
	|ИЗ
	|	Колонки КАК Колонки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяТаблицы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Строки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Колонки";
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;

КонецФункции // СоздатьВременнуюТаблицуКомпонентовОтчета()

Процедура СкопироватьПодчиненныеДанные()
	
	Если Не ПеренестиСтрокиИГрафыНаДругойВидОтчета() Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
						НСтр("ru = 'При копировании был изменен вид отчета. Строки и колонки старого отчета были перенесены на новый, однако, некоторые элементы не имеют соответствия в новом виде отчета. Несовпадающие ссылки очищены.'"),
						ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПеренестиСтрокиИГрафыНаДругойВидОтчета()
 
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СоздатьВременнуюТаблицуКомпонентовОтчета();
	Запрос.УстановитьПараметр("ВидОтчета",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Владелец"));
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтрокиОтчетов.Ссылка,
	|	СтрокиОтчетов.Код КАК Код,
	|	""СтрокиРаздела"" КАК ИмяТаблицы
	|ПОМЕСТИТЬ КомпонентыНовогоОтчета
	|ИЗ
	|	Справочник.СтрокиОтчетов КАК СтрокиОтчетов
	|ГДЕ
	|	СтрокиОтчетов.Владелец = &ВидОтчета
	|	И СтрокиОтчетов.Код В
	|			(ВЫБРАТЬ
	|				КомпонентыОтчета.Код
	|			ИЗ
	|				КомпонентыОтчета КАК КомпонентыОтчета
	|			ГДЕ
	|				КомпонентыОтчета.ИмяТаблицы = ""СтрокиРаздела"")
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КолонкиОтчетов.Ссылка,
	|	КолонкиОтчетов.Код,
	|	""КолонкиРаздела""
	|ИЗ
	|	Справочник.КолонкиОтчетов КАК КолонкиОтчетов
	|ГДЕ
	|	КолонкиОтчетов.Владелец = &ВидОтчета
	|	И КолонкиОтчетов.Код В
	|			(ВЫБРАТЬ
	|				КомпонентыОтчета.Код
	|			ИЗ
	|				КомпонентыОтчета КАК КомпонентыОтчета
	|			ГДЕ
	|				КомпонентыОтчета.ИмяТаблицы = ""КолонкиРаздела"")
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИмяТаблицы,
	|	Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомпонентыОтчета.ИмяТаблицы,
	|	КомпонентыОтчета.НомерСтроки КАК НомерСтроки,
	|	КомпонентыОтчета.Код,
	|	КомпонентыНовогоОтчета.Ссылка КАК СсылкаНовогоОтчета,
	|	ВЫБОР
	|		КОГДА КомпонентыОтчета.ИмяТаблицы = ""СтрокиРаздела""
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок,
	|	КомпонентыОтчета.Заголовок
	|ИЗ
	|	КомпонентыОтчета КАК КомпонентыОтчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ КомпонентыНовогоОтчета КАК КомпонентыНовогоОтчета
	|		ПО КомпонентыОтчета.ИмяТаблицы = КомпонентыНовогоОтчета.ИмяТаблицы
	|			И КомпонентыОтчета.Код = КомпонентыНовогоОтчета.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ЕстьНесовпаденияКомпонентов = Ложь;
		СтрокиРаздела.Очистить();
		КолонкиРаздела.Очистить();
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаТабличнойЧасти = ЭтотОбъект[Выборка.ИмяТаблицы].Добавить();
			СтрокаТабличнойЧасти.Заголовок = Выборка.Заголовок;
			
			Если Выборка.ИмяТаблицы = "СтрокиРаздела" Тогда
				СтрокаТабличнойЧасти.СтрокаОтчета = Выборка.СсылкаНовогоОтчета;
			Иначе
				СтрокаТабличнойЧасти.КолонкаОтчета = Выборка.СсылкаНовогоОтчета;
			КонецЕсли;
			
			Если Выборка.СсылкаНовогоОтчета = Null Тогда
				ЕстьНесовпаденияКомпонентов = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Возврат Не ЕстьНесовпаденияКомпонентов;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;

КонецФункции

Функция СтрокиИГрафыПринадлежатВладельцу()

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СоздатьВременнуюТаблицуКомпонентовОтчета();
	Запрос.УстановитьПараметр("ВидОтчета",  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Владелец"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КомпонентыОтчета.ИмяТаблицы,
	|	КомпонентыОтчета.НомерСтроки
	|ИЗ
	|	КомпонентыОтчета КАК КомпонентыОтчета
	|ГДЕ
	|	КомпонентыОтчета.Ссылка.Владелец <> &ВидОтчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ИмяТаблицы = "СтрокиРаздела" Тогда
				ПредставлениеТаблицы = НСтр("ru = 'Строки раздела'");
				РеквизитСсылки       = "СтрокаОтчета";
			Иначе
				ПредставлениеТаблицы = НСтр("ru = 'Колонки раздела'");
				РеквизитСсылки       = "КолонкаОтчета";
			КонецЕсли;
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'В строке %1 табличной части «%2» запись принадлежит другому виду отчета.'"),
								Выборка.НомерСтроки,
								ПредставлениеТаблицы);
			ОбщегоНазначения.СообщитьПользователю(
										ТекстСообщения, 
										ЭтотОбъект, 
										Выборка.ИмяТаблицы + "["+Выборка.НомерСтроки+"]." + РеквизитСсылки);
			
		КонецЦикла;
		
		Возврат Ложь;
		
	КонецЕсли;

КонецФункции // СтрокиИГрафыПринадлежатВладельцу()

Функция ЭтоКопирование()

	Возврат ДополнительныеСвойства.Свойство("ОбъектКопирования") 
		 	И ЗначениеЗаполнено(ДополнительныеСвойства.ОбъектКопирования);

КонецФункции // ЭтоКопирование()

Функция ОбнаруженыДублиВТабличныхЧастях()

	ЕстьДубли = Ложь;
	
	ДублиСтрок      = ПолучитьДублиСтрокТабличнойЧасти(СтрокиРаздела, "СтрокаОтчета");
	СообщениеСтроки = НСтр("ru = 'В табличной части «Строки отчетов» дублируется строка «%1»'");
	
	Для Каждого СтрДубль Из ДублиСтрок Цикл
		
		ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							СообщениеСтроки, СтрДубль.Объект));

		ЕстьДубли = Истина;
		
	КонецЦикла;
	
	
	ДублиСтрок       = ПолучитьДублиСтрокТабличнойЧасти(КолонкиРаздела, "КолонкаОтчета");
	СообщениеКолонки = НСтр("ru = 'В табличной части «Колонки отчетов» дублируется колонка «%1»'");
	
	Для Каждого СтрДубль Из ДублиСтрок Цикл
		
		ОбщегоНазначения.СообщитьПользователю(
					СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
							СообщениеКолонки, СтрДубль.Объект));
							
		ЕстьДубли = Истина;
		
	КонецЦикла;

	Возврат ЕстьДубли;

КонецФункции // ОбнаруженыДублиВТабличныхЧастях()

Функция ПолучитьДублиСтрокТабличнойЧасти(Знач ТабличнаяЧасть, Знач ИмяКолонкиОбъекта)

	ТаблицаЗначений = ТабличнаяЧасть.Выгрузить(, ИмяКолонкиОбъекта);
	ТаблицаЗначений.Колонки[ИмяКолонкиОбъекта].Имя = "Объект";
	ТаблицаЗначений.Колонки.Добавить("Счетчик", Новый ОписаниеТипов("Число"));
	
	ТаблицаЗначений.ЗаполнитьЗначения(1, "Счетчик");
	ТаблицаЗначений.Свернуть("Объект", "Счетчик");
	
	УникальныеСтроки = ТаблицаЗначений.НайтиСтроки(Новый Структура("Счетчик",1));
	Для Каждого Стр Из УникальныеСтроки Цикл
		ТаблицаЗначений.Удалить(Стр);
	КонецЦикла;

	Возврат ТаблицаЗначений;
	
КонецФункции // ПолучитьДублиСтрокТабличнойЧасти()

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
